{
	"header.info": "Informatie",
	"header.canvas": "Canvas",
	"info.title": "Over dit project",
	"info.subtitle": "Dit project is bedoeld voor educatie en dus is het alleen mogelijk via de API te communiceren. Het is niet mogelijk om de canvas te veranderen via de website.",
	"info.header1": "Inleiding",
	"info.header2": "Een wijziging aanbrengen op het Canvas",
	"info.header3": "Veranderingen in realtime bekijken",
	"info.header4": "Wat is JSON?",
	"info.header5": "Klein voorbeeld",
	"info.content1": "In dit project leren we hoe we een pixel op een canvas kunnen veranderen en ervoor zorgen dat iedereen de veranderingen in realtime kan zien. We zullen een speciale taal genaamd JSON gebruiken om berichten naar een server te sturen die de canvas voor ons zal bijwerken.",
	"info.content2": "Om een pixel op de canvas te veranderen, zullen we in het voorbeeld gebruikmaken van Python-code en een bibliotheek genaamd 'requests'. Het zal ons helpen een bericht naar een server te sturen die de canvas zal updaten met de nieuwe kleur. We zullen een speciaal formaat genaamd JSON gebruiken om het bericht te structureren dat we naar de server sturen. Overigens is Python niet de enige taal waarmee je dit zou kunnen doen. Je kunt ook JavaScript, Java, C#, PHP, Ruby, C++, enz. gebruiken. Het is ook mogelijk om een andere taal te gebruiken, zolang je maar een manier vindt om een bericht naar de server te sturen.",
	"info.content3": "Wanneer we een verandering aanbrengen op de canvas, kan iedereen de veranderingen in realtime zien. Dit is mogelijk dankzij een speciale technologie genaamd WebSocket. Het stelt ons in staat om berichten heen en weer te sturen tussen de server en alle apparaten die de canvas bekijken, zodat iedereen de veranderingen tegelijkertijd ziet.",
	"info.content4": "JSON is een eenvoudige manier om gegevens te organiseren zodat computers het kunnen begrijpen. We zullen het gebruiken om een bericht naar de server te sturen met de kleur die we willen gebruiken om de pixel bij te werken. JSON is echt gemakkelijk te lezen en te schrijven voor mensen, en het is ook gemakkelijk voor computers om te begrijpen. Hieronder kan je een voorbeeld zien van een JSON-bericht dat we naar de server zullen sturen.",
	"info.content5": "Je kunt onder andere Python gebruiken om een bericht naar een server te sturen zodat je een pixel op het canvas kunt veranderen. In het voorbeeld hieronder gebruiken wij de requests library om het bericht te verzenden in het JSON-gegevensformaat.",
	"code.json.title": "JSON body voorbeeld",
	"code.python.title": "Python voorbeeld",
	"copy": "Kopieer",
	"copy.success": "Gekopieerd!"
}